Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00/include/pio/pic32ck2051sg00100.h
/* ========== PORT definition for TCC4 peripheral ========== */
#define PIN_PA11F_TCC4_WO0                         _UINT32_(11)
#define MUX_PA11F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA11F_TCC4_WO0                      ((PIN_PA11F_TCC4_WO0 << 16) | MUX_PA11F_TCC4_WO0)
#define PORT_PA11F_TCC4_WO0                        (_UINT32_(1) << 11)

#define PIN_PA13F_TCC4_WO0                         _UINT32_(13)
#define MUX_PA13F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA13F_TCC4_WO0                      ((PIN_PA13F_TCC4_WO0 << 16) | MUX_PA13F_TCC4_WO0)
#define PORT_PA13F_TCC4_WO0                        (_UINT32_(1) << 13)

#define PIN_PB12F_TCC4_WO0                         _UINT32_(44)
#define MUX_PB12F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PB12F_TCC4_WO0                      ((PIN_PB12F_TCC4_WO0 << 16) | MUX_PB12F_TCC4_WO0)
#define PORT_PB12F_TCC4_WO0                        (_UINT32_(1) << 12)

#define PIN_PA12F_TCC4_WO1                         _UINT32_(12)
#define MUX_PA12F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA12F_TCC4_WO1                      ((PIN_PA12F_TCC4_WO1 << 16) | MUX_PA12F_TCC4_WO1)
#define PORT_PA12F_TCC4_WO1                        (_UINT32_(1) << 12)

#define PIN_PA14F_TCC4_WO1                         _UINT32_(14)
#define MUX_PA14F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA14F_TCC4_WO1                      ((PIN_PA14F_TCC4_WO1 << 16) | MUX_PA14F_TCC4_WO1)
#define PORT_PA14F_TCC4_WO1                        (_UINT32_(1) << 14)

/* ========== PORT definition for TCC5 peripheral ========== */
#define PIN_PA15F_TCC5_WO0                         _UINT32_(15)
#define MUX_PA15F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PA15F_TCC5_WO0                      ((PIN_PA15F_TCC5_WO0 << 16) | MUX_PA15F_TCC5_WO0)
#define PORT_PA15F_TCC5_WO0                        (_UINT32_(1) << 15)

#define PIN_PB00F_TCC5_WO0                         _UINT32_(32)
#define MUX_PB00F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PB00F_TCC5_WO0                      ((PIN_PB00F_TCC5_WO0 << 16) | MUX_PB00F_TCC5_WO0)
#define PORT_PB00F_TCC5_WO0                        (_UINT32_(1) << 0)

#define PIN_PA16F_TCC5_WO1                         _UINT32_(16)
#define MUX_PA16F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PA16F_TCC5_WO1                      ((PIN_PA16F_TCC5_WO1 << 16) | MUX_PA16F_TCC5_WO1)
#define PORT_PA16F_TCC5_WO1                        (_UINT32_(1) << 16)

#define PIN_PB01F_TCC5_WO1                         _UINT32_(33)
#define MUX_PB01F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PB01F_TCC5_WO1                      ((PIN_PB01F_TCC5_WO1 << 16) | MUX_PB01F_TCC5_WO1)
#define PORT_PB01F_TCC5_WO1                        (_UINT32_(1) << 1)

/* ========== PORT definition for TCC6 peripheral ========== */
#define PIN_PB16F_TCC6_WO0                         _UINT32_(48)
#define MUX_PB16F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PB16F_TCC6_WO0                      ((PIN_PB16F_TCC6_WO0 << 16) | MUX_PB16F_TCC6_WO0)
#define PORT_PB16F_TCC6_WO0                        (_UINT32_(1) << 16)

#define PIN_PC01F_TCC6_WO0                         _UINT32_(65)
#define MUX_PC01F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PC01F_TCC6_WO0                      ((PIN_PC01F_TCC6_WO0 << 16) | MUX_PC01F_TCC6_WO0)
#define PORT_PC01F_TCC6_WO0                        (_UINT32_(1) << 1)

#define PIN_PB17F_TCC6_WO1                         _UINT32_(49)
#define MUX_PB17F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PB17F_TCC6_WO1                      ((PIN_PB17F_TCC6_WO1 << 16) | MUX_PB17F_TCC6_WO1)
#define PORT_PB17F_TCC6_WO1                        (_UINT32_(1) << 17)

#define PIN_PC02F_TCC6_WO1                         _UINT32_(66)
#define MUX_PC02F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PC02F_TCC6_WO1                      ((PIN_PC02F_TCC6_WO1 << 16) | MUX_PC02F_TCC6_WO1)
#define PORT_PC02F_TCC6_WO1                        (_UINT32_(1) << 2)

/* ========== PORT definition for TCC7 peripheral ========== */
#define PIN_PB07F_TCC7_WO0                         _UINT32_(39)
#define MUX_PB07F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PB07F_TCC7_WO0                      ((PIN_PB07F_TCC7_WO0 << 16) | MUX_PB07F_TCC7_WO0)
#define PORT_PB07F_TCC7_WO0                        (_UINT32_(1) << 7)

#define PIN_PC03F_TCC7_WO0                         _UINT32_(67)
#define MUX_PC03F_TCC7_WO0                         _UINT32_(5) 
#define PINMUX_PC03F_TCC7_WO0                      ((PIN_PC03F_TCC7_WO0 << 16) | MUX_PC03F_TCC7_WO0)
#define PORT_PC03F_TCC7_WO0                        (_UINT32_(1) << 3)

#define PIN_PB08F_TCC7_WO1                         _UINT32_(40)
#define MUX_PB08F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PB08F_TCC7_WO1                      ((PIN_PB08F_TCC7_WO1 << 16) | MUX_PB08F_TCC7_WO1)
#define PORT_PB08F_TCC7_WO1                        (_UINT32_(1) << 8)

#define PIN_PC04F_TCC7_WO1                         _UINT32_(68)
#define MUX_PC04F_TCC7_WO1                         _UINT32_(5) 
#define PINMUX_PC04F_TCC7_WO1                      ((PIN_PC04F_TCC7_WO1 << 16) | MUX_PC04F_TCC7_WO1)
#define PORT_PC04F_TCC7_WO1                        (_UINT32_(1) << 4)

/* ========== PORT definition for USB peripheral ========== */
#define PIN_PD03H_USB_DM                           _UINT32_(99)
#define MUX_PD03H_USB_DM                           _UINT32_(7) 
#define PINMUX_PD03H_USB_DM                        ((PIN_PD03H_USB_DM << 16) | MUX_PD03H_USB_DM)
#define PORT_PD03H_USB_DM                          (_UINT32_(1) << 3)

#define PIN_PD04H_USB_DP                           _UINT32_(100)
#define MUX_PD04H_USB_DP                           _UINT32_(7) 
#define PINMUX_PD04H_USB_DP                        ((PIN_PD04H_USB_DP << 16) | MUX_PD04H_USB_DP)
#define PORT_PD04H_USB_DP                          (_UINT32_(1) << 4)

#define PIN_PC01H_USB_SOF_1KHZ                     _UINT32_(65)
#define MUX_PC01H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PC01H_USB_SOF_1KHZ                  ((PIN_PC01H_USB_SOF_1KHZ << 16) | MUX_PC01H_USB_SOF_1KHZ)
#define PORT_PC01H_USB_SOF_1KHZ                    (_UINT32_(1) << 1)

#define PIN_PD02H_USB_SOF_1KHZ                     _UINT32_(98)
#define MUX_PD02H_USB_SOF_1KHZ                     _UINT32_(7) 
#define PINMUX_PD02H_USB_SOF_1KHZ                  ((PIN_PD02H_USB_SOF_1KHZ << 16) | MUX_PD02H_USB_SOF_1KHZ)
#define PORT_PD02H_USB_SOF_1KHZ                    (_UINT32_(1) << 2)



#endif /* _PIC32CK2051SG00100_GPIO_H_ */

